---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.StructWallAnalyticalErrorAlign
source: html/761ff618-dbb1-0de4-a90f-09c38c185f90.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.StructWallAnalyticalErrorAlign Property

Can't align Analytical Model with joined Walls.

## Syntax (C#)
```csharp
public static FailureDefinitionId StructWallAnalyticalErrorAlign { get; }
```